Update Mathematical Modeling & Optimization.md
